---
kind: other
id: AllMembers.T:Autodesk.Revit.Exceptions.TransientElementCreationException
source: html/0a774137-1e3f-263e-433d-e6c68ab9e684.htm
---
# TransientElementCreationException Members

Retrieves data needed to serialize the target object.